;アッカーマン関数
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1) (A x (- y 1))))))


(print (A 1 10))
#|
(A 1 10)
(A (- 1 1) (A 1 (- 10 1)))
(A 0 (A (- 1 1) (A 1 (- 9 1))))
(A 0 (A 0 (A (-1 1) (A 1 (- 8 1)))))
;
;
(* 2 (* 2 (* 2 (* 2 (* 2 (* 2 (* 2 (* 2 (* 2 2)))))))))
2の10乗
|#


(print (A 2 4))
#|
(A 2 4)
(A 1 (A 2 (- 4 1))
(A 1 (A 2 3))
(A 1 (A 1 (A 2 2)))
(A 1 (A 1 (A 1 (A 2 1))))
(A 1 (A 1 (A 1 2)))
          ------ここは2の2乗
(A 1 (A 1 4))
     ------2の4乗
(A 1 16)
-------2の16乗
2の2の2の2乗乗乗
|#



(print (A 3 3))
#|
(A 3 3)
(A 2 (A 3 2))
(A 2 (A 2 (A 3 1)))
(A 2 (A 2 2))
     -------2を2乗したもの
(A 2 4)
|#


;雰囲気はわかったけど数学的定義ってなんや
;なんか２をどんどん重ねてく感じ
